#### Terraform Format and Style 🖌`success`
#### Terraform Initialization 🤖`success`
#### Terraform Validation 🤖`success`
#### Terraform Workspace 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```diff
module.eks.module.eks_managed_node_group["one"].data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.data.aws_caller_identity.current[0]: Reading...
module.irsa-ebs-csi.data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["two"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["two"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_partition.current[0]: Reading...
module.irsa-ebs-csi.data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["one"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["one"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["one"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["two"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["two"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.irsa-ebs-csi.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy.ebs_csi_policy: Reading...
module.eks.module.eks_managed_node_group["two"].data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
data.aws_availability_zones.available: Reading...
module.eks.module.eks_managed_node_group["one"].data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=893777461466]
module.irsa-ebs-csi.data.aws_caller_identity.current: Read complete after 0s [id=893777461466]
module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=893777461466]
module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks.module.eks_managed_node_group["one"].data.aws_caller_identity.current: Read complete after 0s [id=893777461466]
module.eks.module.eks_managed_node_group["two"].data.aws_caller_identity.current: Read complete after 0s [id=893777461466]
data.aws_caller_identity.current: Read complete after 0s [id=893777461466]
data.aws_iam_openid_connect_provider.github_actions_oidc: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.eks.data.aws_iam_session_context.current[0]: Read complete after 1s [id=arn:aws:sts::893777461466:assumed-role/github-actions-iac-role/GitHubActions]
data.aws_iam_openid_connect_provider.github_actions_oidc: Read complete after 1s [id=arn:aws:iam::893777461466:oidc-provider/token.actions.githubusercontent.com]
aws_iam_role.github_actions_iac_role: Refreshing state... [id=github-actions-iac-role]
aws_iam_role.github_actions_deploy_role: Refreshing state... [id=github-actions-deploy-role]
data.aws_iam_policy.ebs_csi_policy: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy]
aws_iam_role_policy.github_actions_deploy_policy: Refreshing state... [id=github-actions-deploy-role:github-actions-deploy-policy]
aws_iam_role_policy.github_actions_iac_policy: Refreshing state... [id=github-actions-iac-role:github-actions-iac-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
! update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_acm_certificate.cert will be created
+ resource "aws_acm_certificate" "cert" {
+ arn                       = (known after apply)
+ domain_name               = "*.stg.jupter.xyz"
+ domain_validation_options = [
+ {
+ domain_name           = "*.stg.jupter.xyz"
+ resource_record_name  = (known after apply)
+ resource_record_type  = (known after apply)
+ resource_record_value = (known after apply)
            },
        ]
+ id                        = (known after apply)
+ key_algorithm             = (known after apply)
+ not_after                 = (known after apply)
+ not_before                = (known after apply)
+ pending_renewal           = (known after apply)
+ renewal_eligibility       = (known after apply)
+ renewal_summary           = (known after apply)
+ status                    = (known after apply)
+ subject_alternative_names = [
+ "*.stg.jupter.xyz",
        ]
+ tags_all                  = {
+ "Environment"     = "stg"
+ "HashiCorp-Learn" = "aws-default-tags"
+ "Project"         = "DevOps"
+ "Purpose"         = "Terraform Workshop"
+ "Service"         = "eks"
+ "Terraform"       = "true"
        }
+ type                      = (known after apply)
+ validation_emails         = (known after apply)
+ validation_method         = "DNS"
+ options (known after apply)
    }

  # aws_iam_role.github_actions_iac_role will be updated in-place
! resource "aws_iam_role" "github_actions_iac_role" {
! assume_role_policy    = jsonencode(
! {
! Statement = [
! {
! Condition = {
! StringEquals = {
! "token.actions.githubusercontent.com:sub" = [
                                    # (2 unchanged elements hidden)
                                    "repo:davidlimacardoso/fakeapp-iac-terraform-k8s:ref:refs/heads/developer",
- "repo:davidlimacardoso/fakeapp-iac-terraform-k8s:pull_request",
                                ]
                                # (1 unchanged attribute hidden)
                            }
                        }
+ Sid       = ""
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "github-actions-iac-role"
        name                  = "github-actions-iac-role"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # null_resource.validate_workspace will be created
+ resource "null_resource" "validate_workspace" {
+ id = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+ addon_name         = "aws-ebs-csi-driver"
+ id                 = (known after apply)
+ kubernetes_version = "1.31"
+ version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
+ certificates = (known after apply)
+ id           = (known after apply)
+ url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
+ resource "aws_cloudwatch_log_group" "this" {
+ arn               = (known after apply)
+ id                = (known after apply)
+ log_group_class   = (known after apply)
+ name              = "/aws/eks/demo-cluster-stg/cluster"
+ name_prefix       = (known after apply)
+ retention_in_days = 90
+ skip_destroy      = false
+ tags              = {
+ "Name" = "/aws/eks/demo-cluster-stg/cluster"
        }
+ tags_all          = {
+ "Environment"     = "stg"
+ "HashiCorp-Learn" = "aws-default-tags"
+ "Name"            = "/aws/eks/demo-cluster-stg/cluster"
+ "Project"         = "DevOps"
+ "Purpose"         = "Terraform Workshop"
+ "Service"         = "eks"
+ "Terraform"       = "true"
        }
    }

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
+ resource "aws_eks_addon" "this" {
+ addon_name                  = "aws-ebs-csi-driver"
+ addon_version               = (known after apply)
+ arn                         = (known after apply)
+ cluster_name                = (known after apply)
+ configuration_values        = (known after apply)
+ created_at                  = (known after apply)
+ id                          = (known after apply)
+ modified_at                 = (known after apply)
+ preserve                    = true
+ resolve_conflicts_on_create = "OVERWRITE"
+ resolve_conflicts_on_update = "OVERWRITE"
+ service_account_role_arn    = (known after apply)
+ tags_all                    = {
+ "Environment"     = "stg"
+ "HashiCorp-Learn" = "aws-default-tags"
+ "Project"         = "DevOps"
+ "Purpose"         = "Terraform Workshop"
+ "Service"         = "eks"
+ "Terraform"       = "true"
        }
+ timeouts {}
    }

  # module.eks.aws_eks_cluster.this[0] will be created
+ resource "aws_eks_cluster" "this" {
+ arn                           = (known after apply)
+ bootstrap_self_managed_addons = true
+ certificate_authority         = (known after apply)
+ cluster_id                    = (known after apply)
+ created_at                    = (known after apply)
+ enabled_cluster_log_types     = [
+ "api",
+ "audit",
+ "authenticator",
        ]
+ endpoint                      = (known after apply)
+ id                            = (known after apply)
+ identity                      = (known after apply)
+ name                          = "demo-cluster-stg"
+ platform_version              = (known after apply)
+ role_arn                      = (known after apply)
+ status                        = (known after apply)
+ tags                          = {
+ "terraform-aws-modules" = "eks"
        }
+ tags_all                      = {
+ "Environment"           = "stg"
+ "HashiCorp-Learn"       = "aws-default-tags"
+ "Project"               = "DevOps"
+ "Purpose"               = "Terraform Workshop"
+ "Service"               = "eks"
+ "Terraform"             = "true"
+ "terraform-aws-modules" = "eks"
        }
+ version                       = "1.31"
+ access_config {
+ authentication_mode                         = "API"
+ bootstrap_cluster_creator_admin_permissions = false
        }
+ encryption_config {
+ resources = [
+ "secrets",
            ]
+ provider {
+ key_arn = (known after apply)
            }
        }
+ kubernetes_network_config {
+ ip_family         = "ipv4"
+ service_ipv4_cidr = (known after apply)
+ service_ipv6_cidr = (known after apply)
+ elastic_load_balancing (known after apply)
        }
+ timeouts {}
+ upgrade_policy (known after apply)
+ vpc_config {
+ cluster_security_group_id = (known after apply)
+ endpoint_private_access   = true
+ endpoint_public_access    = true
+ public_access_cidrs       = [
+ "0.0.0.0/0",
            ]
+ security_group_ids        = (known after apply)
+ subnet_ids                = [
+ "subnet-04e972ab97a50a310",
+ "subnet-0c9478d9da82f0579",
            ]
+ vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
+ resource "aws_iam_openid_connect_provider" "oidc_provider" {
+ arn             = (known after apply)
+ client_id_list  = [
+ "sts.amazonaws.com",
        ]
+ id              = (known after apply)
+ tags            = {
+ "Name" = "demo-cluster-stg-eks-irsa"
        }
+ tags_all        = {
+ "Environment"     = "stg"
+ "HashiCorp-Learn" = "aws-default-tags"
+ "Name"            = "demo-cluster-stg-eks-irsa"
+ "Project"         = "DevOps"
+ "Purpose"         = "Terraform Workshop"
+ "Service"         = "eks"
+ "Terraform"       = "true"
        }
+ thumbprint_list = (known after apply)
+ url             = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be created
+ resource "aws_iam_policy" "cluster_encryption" {
+ arn              = (known after apply)
+ attachment_count = (known after apply)
+ description      = "Cluster encryption policy to allow cluster role to utilize CMK provided"
+ id               = (known after apply)
+ name             = (known after apply)
+ name_prefix      = "demo-cluster-stg-cluster-ClusterEncryption"
+ path             = "/"
+ policy           = (known after apply)
+ policy_id        = (known after apply)
+ tags_all         = {
+ "Environment"     = "stg"
+ "HashiCorp-Learn" = "aws-default-tags"
+ "Project"         = "DevOps"
+ "Purpose"         = "Terraform Workshop"
+ "Service"         = "eks"
+ "Terraform"       = "true"
        }
    }

  # module.eks.aws_iam_policy.custom[0] will be created
+ resource "aws_iam_policy" "custom" {
+ arn              = (known after apply)
+ attachment_count = (known after apply)
+ id               = (known after apply)
+ name             = (known after apply)
+ name_prefix      = "demo-cluster-stg-cluster-"
+ path             = "/"
+ policy           = jsonencode(
            {
+ Statement = [
+ {
+ Action    = [
+ "ec2:RunInstances",
+ "ec2:CreateLaunchTemplate",
+ "ec2:CreateFleet",
                        ]
+ Condition = {
+ StringEquals = {
+ "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
+ StringLike   = {
+ "aws:RequestTag/eks:kubernetes-node-class-name" = "*"
+ "aws:RequestTag/eks:kubernetes-node-pool-name"  = "*"
                            }
                        }
+ Effect    = "Allow"
+ Resource  = "*"
+ Sid       = "Compute"
                    },
+ {
+ Action    = [
+ "ec2:CreateVolume",
+ "ec2:CreateSnapshot",
                        ]
+ Condition = {
+ StringEquals = {
+ "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
+ Effect    = "Allow"
+ Resource  = [
+ "arn:aws:ec2:*:*:volume/*",
+ "arn:aws:ec2:*:*:snapshot/*",
                        ]
+ Sid       = "Storage"
                    },
+ {
+ Action    = "ec2:CreateNetworkInterface"
+ Condition = {
+ StringEquals = {
+ "aws:RequestTag/eks:eks-cluster-name"         = "${aws:PrincipalTag/eks:eks-cluster-name}"
+ "aws:RequestTag/eks:kubernetes-cni-node-name" = "*"
                            }
                        }
+ Effect    = "Allow"
+ Resource  = "*"
+ Sid       = "Networking"
                    },
+ {
+ Action    = [
+ "elasticloadbalancing:CreateTargetGroup",
+ "elasticloadbalancing:CreateRule",
+ "elasticloadbalancing:CreateLoadBalancer",
+ "elasticloadbalancing:CreateListener",
+ "ec2:CreateSecurityGroup",
                        ]
+ Condition = {
+ StringEquals = {
+ "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
+ Effect    = "Allow"
+ Resource  = "*"
+ Sid       = "LoadBalancer"
                    },
+ {
+ Action    = "shield:CreateProtection"
+ Condition = {
+ StringEquals = {
+ "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
+ Effect    = "Allow"
+ Resource  = "*"
+ Sid       = "ShieldProtection"
                    },
+ {
+ Action    = "shield:TagResource"
+ Condition = {
+ StringEquals = {
+ "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
+ Effect    = "Allow"
+ Resource  = "arn:aws:shield::*:protection/*"
+ Sid       = "ShieldTagResource"
                    },
                ]
+ Version   = "2012-10-17"
            }
        )
+ policy_id        = (known after apply)
+ tags_all         = {
+ "Environment"     = "stg"
+ "HashiCorp-Learn" = "aws-default-tags"
+ "Project"         = "DevOps"
+ "Purpose"         = "Terraform Workshop"
+ "Service"         = "eks"
+ "Terraform"       = "true"
        }
    }

  # module.eks.aws_iam_role.this[0] will be created
+ resource "aws_iam_role" "this" {
+ arn                   = (known after apply)
+ assume_role_policy    = jsonencode(
            {
+ Statement = [
+ {
+ Action    = [
+ "sts:TagSession",
+ "sts:AssumeRole",
                        ]
+ Effect    = "Allow"
+ Principal = {
+ Service = "eks.amazonaws.com"
                        }
+ Sid       = "EKSClusterAssumeRole"
                    },
                ]
+ Version   = "2012-10-17"
            }
        )
+ create_date           = (known after apply)
+ force_detach_policies = true
+ id                    = (known after apply)
+ managed_policy_arns   = (known after apply)
+ max_session_duration  = 3600
+ name                  = (known after apply)
+ name_prefix           = "demo-cluster-stg-cluster-"
+ path                  = "/"
+ tags_all              = {
+ "Environment"     = "stg"
+ "HashiCorp-Learn" = "aws-default-tags"
+ "Project"         = "DevOps"
+ "Purpose"         = "Terraform Workshop"
+ "Service"         = "eks"
+ "Terraform"       = "true"
        }
+ unique_id             = (known after apply)
+ inline_policy (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
+ resource "aws_iam_role_policy_attachment" "cluster_encryption" {
+ id         = (known after apply)
+ policy_arn = (known after apply)
+ role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.custom[0] will be created
+ resource "aws_iam_role_policy_attachment" "custom" {
+ id         = (known after apply)
+ policy_arn = (known after apply)
+ role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
+ id         = (known after apply)
+ policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
+ role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
+ id         = (known after apply)
+ policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
+ role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
+ resource "aws_security_group" "cluster" {
+ arn                    = (known after apply)
+ description            = "EKS cluster security group"
+ egress                 = (known after apply)
+ id                     = (known after apply)
+ ingress                = (known after apply)
+ name                   = (known after apply)
+ name_prefix            = "demo-cluster-stg-cluster-"
+ owner_id               = (known after apply)
+ revoke_rules_on_delete = false
+ tags                   = {
+ "Name" = "demo-cluster-stg-cluster"
        }
+ tags_all               = {
+ "Environment"     = "stg"
+ "HashiCorp-Learn" = "aws-default-tags"
+ "Name"            = "demo-cluster-stg-cluster"
+ "Project"         = "DevOps"
+ "Purpose"         = "Terraform Workshop"
+ "Service"         = "eks"
+ "Terraform"       = "true"
        }
+ vpc_id                 = "vpc-028e5bd127ffb9444"
    }

  # module.eks.aws_security_group.node[0] will be created
+ resource "aws_security_group" "node" {
+ arn                    = (known after apply)
+ description            = "EKS node shared security group"
+ egress                 = (known after apply)
+ id                     = (known after apply)
+ ingress                = (known after apply)
+ name                   = (known after apply)
+ name_prefix            = "demo-cluster-stg-node-"
+ owner_id               = (known after apply)
+ revoke_rules_on_delete = false
+ tags                   = {
+ "Name"                                   = "demo-cluster-stg-node"
+ "kubernetes.io/cluster/demo-cluster-stg" = "owned"
        }
+ tags_all               = {
+ "Environment"                            = "stg"
+ "HashiCorp-Learn"                        = "aws-default-tags"
+ "Name"                                   = "demo-cluster-stg-node"
+ "Project"                                = "DevOps"
+ "Purpose"                                = "Terraform Workshop"
+ "Service"                                = "eks"
+ "Terraform"                              = "true"
+ "kubernetes.io/cluster/demo-cluster-stg" = "owned"
        }
+ vpc_id                 = "vpc-028e5bd127ffb9444"
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
+ resource "aws_security_group_rule" "cluster" {
+ description              = "Node groups to cluster API"
+ from_port                = 443
+ id                       = (known after apply)
+ protocol                 = "tcp"
+ security_group_id        = (known after apply)
+ security_group_rule_id   = (known after apply)
+ self                     = false
+ source_security_group_id = (known after apply)
+ to_port                  = 443
+ type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_all"] will be created
+ resource "aws_security_group_rule" "node" {
+ cidr_blocks              = [
+ "0.0.0.0/0",
        ]
+ description              = "Allow all egress"
+ from_port                = 0
+ id                       = (known after apply)
+ prefix_list_ids          = []
+ protocol                 = "-1"
+ security_group_id        = (known after apply)
+ security_group_rule_id   = (known after apply)
+ self                     = false
+ source_security_group_id = (known after apply)
+ to_port                  = 0
+ type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
+ resource "aws_security_group_rule" "node" {
+ description              = "Cluster API to node groups"
+ from_port                = 443
+ id                       = (known after apply)
+ prefix_list_ids          = []
+ protocol                 = "tcp"
+ security_group_id        = (known after apply)
+ security_group_rule_id   = (known after apply)
+ self                     = false
+ source_security_group_id = (known after apply)
+ to_port                  = 443
+ type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
+ resource "aws_security_group_rule" "node" {
+ description              = "Cluster API to node 4443/tcp webhook"
+ from_port                = 4443
+ id                       = (known after apply)
+ prefix_list_ids          = []
+ protocol                 = "tcp"
+ security_group_id        = (known after apply)
+ security_group_rule_id   = (known after apply)
+ self                     = false
+ source_security_group_id = (known after apply)
+ to_port                  = 4443
+ type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
+ resource "aws_security_group_rule" "node" {
+ description              = "Cluster API to node 6443/tcp webhook"
+ from_port                = 6443
+ id                       = (known after apply)
+ prefix_list_ids          = []
+ protocol                 = "tcp"
+ security_group_id        = (known after apply)
+ security_group_rule_id   = (known after apply)
+ self                     = false
+ source_security_group_id = (known after apply)
+ to_port                  = 6443
+ type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
+ resource "aws_security_group_rule" "node" {
+ description              = "Cluster API to node 8443/tcp webhook"
+ from_port                = 8443
+ id                       = (known after apply)
+ prefix_list_ids          = []
+ protocol                 = "tcp"
+ security_group_id        = (known after apply)
+ security_group_rule_id   = (known after apply)
+ self                     = false
+ source_security_group_id = (known after apply)
+ to_port                  = 8443
+ type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
+ resource "aws_security_group_rule" "node" {
+ description              = "Cluster API to node 9443/tcp webhook"
+ from_port                = 9443
+ id                       = (known after apply)
+ prefix_list_ids          = []
+ protocol                 = "tcp"
+ security_group_id        = (known after apply)
+ security_group_rule_id   = (known after apply)
+ self                     = false
+ source_security_group_id = (known after apply)
+ to_port                  = 9443
+ type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
+ resource "aws_security_group_rule" "node" {
+ description              = "Cluster API to node kubelets"
+ from_port                = 10250
+ id                       = (known after apply)
+ prefix_list_ids          = []
+ protocol                 = "tcp"
+ security_group_id        = (known after apply)
+ security_group_rule_id   = (known after apply)
+ self                     = false
+ source_security_group_id = (known after apply)
+ to_port                  = 10250
+ type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
+ resource "aws_security_group_rule" "node" {
+ description              = "Node to node ingress on ephemeral ports"
+ from_port                = 1025
+ id                       = (known after apply)
+ prefix_list_ids          = []
+ protocol                 = "tcp"
+ security_group_id        = (known after apply)
+ security_group_rule_id   = (known after apply)
+ self                     = true
+ source_security_group_id = (known after apply)
+ to_port                  = 65535
+ type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
+ resource "aws_security_group_rule" "node" {
+ description              = "Node to node CoreDNS"
+ from_port                = 53
+ id                       = (known after apply)
+ prefix_list_ids          = []
+ protocol                 = "tcp"
+ security_group_id        = (known after apply)
+ security_group_rule_id   = (known after apply)
+ self                     = true
+ source_security_group_id = (known after apply)
+ to_port                  = 53
+ type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
+ resource "aws_security_group_rule" "node" {
+ description              = "Node to node CoreDNS UDP"
+ from_port                = 53
+ id                       = (known after apply)
+ prefix_list_ids          = []
+ protocol                 = "udp"
+ security_group_id        = (known after apply)
+ security_group_rule_id   = (known after apply)
+ self                     = true
+ source_security_group_id = (known after apply)
+ to_port                  = 53
+ type                     = "ingress"
    }

  # module.eks.time_sleep.this[0] will be created
+ resource "time_sleep" "this" {
+ create_duration = "30s"
+ id              = (known after apply)
+ triggers        = {
+ "cluster_certificate_authority_data" = (known after apply)
+ "cluster_endpoint"                   = (known after apply)
+ "cluster_name"                       = (known after apply)
+ "cluster_service_cidr"               = (known after apply)
+ "cluster_version"                    = "1.31"
        }
    }

  # module.irsa-ebs-csi.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc" {
+ id            = (known after apply)
+ json          = (known after apply)
+ minified_json = (known after apply)
+ statement (known after apply)
    }

  # module.irsa-ebs-csi.aws_iam_role.this[0] will be created
+ resource "aws_iam_role" "this" {
+ arn                   = (known after apply)
+ assume_role_policy    = (known after apply)
+ create_date           = (known after apply)
+ force_detach_policies = false
+ id                    = (known after apply)
+ managed_policy_arns   = (known after apply)
+ max_session_duration  = 3600
+ name                  = "AmazonEKSTFEBSCSIRole-demo-cluster-stg"
+ name_prefix           = (known after apply)
+ path                  = "/"
+ tags_all              = {
+ "Environment"     = "stg"
+ "HashiCorp-Learn" = "aws-default-tags"
+ "Project"         = "DevOps"
+ "Purpose"         = "Terraform Workshop"
+ "Service"         = "eks"
+ "Terraform"       = "true"
        }
+ unique_id             = (known after apply)
        # (2 unchanged attributes hidden)
+ inline_policy (known after apply)
    }

  # module.irsa-ebs-csi.aws_iam_role_policy_attachment.custom[0] will be created
+ resource "aws_iam_role_policy_attachment" "custom" {
+ id         = (known after apply)
+ policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
+ role       = "AmazonEKSTFEBSCSIRole-demo-cluster-stg"
    }

  # module.eks.module.eks_managed_node_group["one"].aws_eks_node_group.this[0] will be created
+ resource "aws_eks_node_group" "this" {
+ ami_type               = "AL2_x86_64"
+ arn                    = (known after apply)
+ capacity_type          = (known after apply)
+ cluster_name           = (known after apply)
+ disk_size              = (known after apply)
+ id                     = (known after apply)
+ instance_types         = [
+ "t3.small",
        ]
+ node_group_name        = (known after apply)
+ node_group_name_prefix = "ng-1-demo-cluster-stg-"
+ node_role_arn          = (known after apply)
+ release_version        = (known after apply)
+ resources              = (known after apply)
+ status                 = (known after apply)
+ subnet_ids             = [
+ "subnet-04e972ab97a50a310",
+ "subnet-0c9478d9da82f0579",
        ]
+ tags                   = {
+ "Name" = "ng-1-demo-cluster-stg"
        }
+ tags_all               = {
+ "Environment"     = "stg"
+ "HashiCorp-Learn" = "aws-default-tags"
+ "Name"            = "ng-1-demo-cluster-stg"
+ "Project"         = "DevOps"
+ "Purpose"         = "Terraform Workshop"
+ "Service"         = "eks"
+ "Terraform"       = "true"
        }
+ version                = "1.31"
+ launch_template {
+ id      = (known after apply)
+ name    = (known after apply)
+ version = (known after apply)
        }
+ scaling_config {
+ desired_size = 1
+ max_size     = 1
+ min_size     = 1
        }
+ timeouts {}
+ update_config {
+ max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["one"].aws_iam_role.this[0] will be created
+ resource "aws_iam_role" "this" {
+ arn                   = (known after apply)
+ assume_role_policy    = jsonencode(
            {
+ Statement = [
+ {
+ Action    = "sts:AssumeRole"
+ Effect    = "Allow"
+ Principal = {
+ Service = "ec2.amazonaws.com"
                        }
+ Sid       = "EKSNodeAssumeRole"
                    },
                ]
+ Version   = "2012-10-17"
            }
        )
+ create_date           = (known after apply)
+ description           = "EKS managed node group IAM role"
+ force_detach_policies = true
+ id                    = (known after apply)
+ managed_policy_arns   = (known after apply)
+ max_session_duration  = 3600
+ name                  = (known after apply)
+ name_prefix           = "ng-1-demo-cluster-stg-eks-node-group-"
+ path                  = "/"
+ tags_all              = {
+ "Environment"     = "stg"
+ "HashiCorp-Learn" = "aws-default-tags"
+ "Project"         = "DevOps"
+ "Purpose"         = "Terraform Workshop"
+ "Service"         = "eks"
+ "Terraform"       = "true"
        }
+ unique_id             = (known after apply)
+ inline_policy (known after apply)
    }

  # module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
+ id         = (known after apply)
+ policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+ role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
+ id         = (known after apply)
+ policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
+ role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
+ id         = (known after apply)
+ policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
+ role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["one"].aws_launch_template.this[0] will be created
+ resource "aws_launch_template" "this" {
+ arn                    = (known after apply)
+ default_version        = (known after apply)
+ description            = "Custom launch template for ng-1-demo-cluster-stg EKS managed node group"
+ id                     = (known after apply)
+ latest_version         = (known after apply)
+ name                   = (known after apply)
+ name_prefix            = "one-"
+ tags_all               = {
+ "Environment"     = "stg"
+ "HashiCorp-Learn" = "aws-default-tags"
+ "Project"         = "DevOps"
+ "Purpose"         = "Terraform Workshop"
+ "Service"         = "eks"
+ "Terraform"       = "true"
        }
+ update_default_version = true
+ vpc_security_group_ids = (known after apply)
        # (2 unchanged attributes hidden)
+ block_device_mappings {
+ device_name = "/dev/xvda"
+ ebs {
+ delete_on_termination = "true"
+ encrypted             = "true"
+ iops                  = (known after apply)
+ throughput            = (known after apply)
+ volume_size           = 40
+ volume_type           = "gp3"
            }
        }
+ metadata_options {
+ http_endpoint               = "enabled"
+ http_protocol_ipv6          = (known after apply)
+ http_put_response_hop_limit = 2
+ http_tokens                 = "required"
+ instance_metadata_tags      = (known after apply)
        }
+ monitoring {
+ enabled = true
        }
+ tag_specifications {
+ resource_type = "instance"
+ tags          = {
+ "Name" = "ng-1-demo-cluster-stg"
            }
        }
+ tag_specifications {
+ resource_type = "network-interface"
+ tags          = {
+ "Name" = "ng-1-demo-cluster-stg"
            }
        }
+ tag_specifications {
+ resource_type = "volume"
+ tags          = {
+ "Name" = "ng-1-demo-cluster-stg"
            }
        }
    }

  # module.eks.module.eks_managed_node_group["two"].aws_eks_node_group.this[0] will be created
+ resource "aws_eks_node_group" "this" {
+ ami_type               = "AL2_x86_64"
+ arn                    = (known after apply)
+ capacity_type          = (known after apply)
+ cluster_name           = (known after apply)
+ disk_size              = (known after apply)
+ id                     = (known after apply)
+ instance_types         = [
+ "t3.small",
        ]
+ node_group_name        = (known after apply)
+ node_group_name_prefix = "ng-2-demo-cluster-stg-"
+ node_role_arn          = (known after apply)
+ release_version        = (known after apply)
+ resources              = (known after apply)
+ status                 = (known after apply)
+ subnet_ids             = [
+ "subnet-04e972ab97a50a310",
+ "subnet-0c9478d9da82f0579",
        ]
+ tags                   = {
+ "Name" = "ng-2-demo-cluster-stg"
        }
+ tags_all               = {
+ "Environment"     = "stg"
+ "HashiCorp-Learn" = "aws-default-tags"
+ "Name"            = "ng-2-demo-cluster-stg"
+ "Project"         = "DevOps"
+ "Purpose"         = "Terraform Workshop"
+ "Service"         = "eks"
+ "Terraform"       = "true"
        }
+ version                = "1.31"
+ launch_template {
+ id      = (known after apply)
+ name    = (known after apply)
+ version = (known after apply)
        }
+ scaling_config {
+ desired_size = 1
+ max_size     = 1
+ min_size     = 1
        }
+ timeouts {}
+ update_config {
+ max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["two"].aws_iam_role.this[0] will be created
+ resource "aws_iam_role" "this" {
+ arn                   = (known after apply)
+ assume_role_policy    = jsonencode(
            {
+ Statement = [
+ {
+ Action    = "sts:AssumeRole"
+ Effect    = "Allow"
+ Principal = {
+ Service = "ec2.amazonaws.com"
                        }
+ Sid       = "EKSNodeAssumeRole"
                    },
                ]
+ Version   = "2012-10-17"
            }
        )
+ create_date           = (known after apply)
+ description           = "EKS managed node group IAM role"
+ force_detach_policies = true
+ id                    = (known after apply)
+ managed_policy_arns   = (known after apply)
+ max_session_duration  = 3600
+ name                  = (known after apply)
+ name_prefix           = "ng-2-demo-cluster-stg-eks-node-group-"
+ path                  = "/"
+ tags_all              = {
+ "Environment"     = "stg"
+ "HashiCorp-Learn" = "aws-default-tags"
+ "Project"         = "DevOps"
+ "Purpose"         = "Terraform Workshop"
+ "Service"         = "eks"
+ "Terraform"       = "true"
        }
+ unique_id             = (known after apply)
+ inline_policy (known after apply)
    }

  # module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
+ id         = (known after apply)
+ policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+ role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
+ id         = (known after apply)
+ policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
+ role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
+ id         = (known after apply)
+ policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
+ role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["two"].aws_launch_template.this[0] will be created
+ resource "aws_launch_template" "this" {
+ arn                    = (known after apply)
+ default_version        = (known after apply)
+ description            = "Custom launch template for ng-2-demo-cluster-stg EKS managed node group"
+ id                     = (known after apply)
+ latest_version         = (known after apply)
+ name                   = (known after apply)
+ name_prefix            = "two-"
+ tags_all               = {
+ "Environment"     = "stg"
+ "HashiCorp-Learn" = "aws-default-tags"
+ "Project"         = "DevOps"
+ "Purpose"         = "Terraform Workshop"
+ "Service"         = "eks"
+ "Terraform"       = "true"
        }
+ update_default_version = true
+ vpc_security_group_ids = (known after apply)
        # (2 unchanged attributes hidden)
+ block_device_mappings {
+ device_name = "/dev/xvda"
+ ebs {
+ delete_on_termination = "true"
+ encrypted             = "true"
+ iops                  = (known after apply)
+ throughput            = (known after apply)
+ volume_size           = 40
+ volume_type           = "gp3"
            }
        }
+ metadata_options {
+ http_endpoint               = "enabled"
+ http_protocol_ipv6          = (known after apply)
+ http_put_response_hop_limit = 2
+ http_tokens                 = "required"
+ instance_metadata_tags      = (known after apply)
        }
+ monitoring {
+ enabled = true
        }
+ tag_specifications {
+ resource_type = "instance"
+ tags          = {
+ "Name" = "ng-2-demo-cluster-stg"
            }
        }
+ tag_specifications {
+ resource_type = "network-interface"
+ tags          = {
+ "Name" = "ng-2-demo-cluster-stg"
            }
        }
+ tag_specifications {
+ resource_type = "volume"
+ tags          = {
+ "Name" = "ng-2-demo-cluster-stg"
            }
        }
    }

  # module.eks.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+ id                        = (known after apply)
+ json                      = (known after apply)
+ minified_json             = (known after apply)
+ override_policy_documents = []
+ source_policy_documents   = []
+ statement {
+ actions   = [
+ "kms:*",
            ]
+ resources = [
+ "*",
            ]
+ sid       = "Default"
+ principals {
+ identifiers = [
+ "arn:aws:iam::893777461466:root",
                ]
+ type        = "AWS"
            }
        }
+ statement {
+ actions   = [
+ "kms:CancelKeyDeletion",
+ "kms:Create*",
+ "kms:Delete*",
+ "kms:Describe*",
+ "kms:Disable*",
+ "kms:Enable*",
+ "kms:Get*",
+ "kms:ImportKeyMaterial",
+ "kms:List*",
+ "kms:Put*",
+ "kms:ReplicateKey",
+ "kms:Revoke*",
+ "kms:ScheduleKeyDeletion",
+ "kms:TagResource",
+ "kms:UntagResource",
+ "kms:Update*",
            ]
+ resources = [
+ "*",
            ]
+ sid       = "KeyAdministration"
+ principals {
+ identifiers = [
+ "arn:aws:iam::893777461466:role/github-actions-iac-role",
                ]
+ type        = "AWS"
            }
        }
+ statement {
+ actions   = [
+ "kms:Decrypt",
+ "kms:DescribeKey",
+ "kms:Encrypt",
+ "kms:GenerateDataKey*",
+ "kms:ReEncrypt*",
            ]
+ resources = [
+ "*",
            ]
+ sid       = "KeyUsage"
+ principals {
+ identifiers = [
+ (known after apply),
                ]
+ type        = "AWS"
            }
        }
    }

  # module.eks.module.kms.aws_kms_alias.this["cluster"] will be created
+ resource "aws_kms_alias" "this" {
+ arn            = (known after apply)
+ id             = (known after apply)
+ name           = "alias/eks/demo-cluster-stg"
+ name_prefix    = (known after apply)
+ target_key_arn = (known after apply)
+ target_key_id  = (known after apply)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be created
+ resource "aws_kms_key" "this" {
+ arn                                = (known after apply)
+ bypass_policy_lockout_safety_check = false
+ customer_master_key_spec           = "SYMMETRIC_DEFAULT"
+ description                        = "demo-cluster-stg cluster encryption key"
+ enable_key_rotation                = true
+ id                                 = (known after apply)
+ is_enabled                         = true
+ key_id                             = (known after apply)
+ key_usage                          = "ENCRYPT_DECRYPT"
+ multi_region                       = false
+ policy                             = (known after apply)
+ rotation_period_in_days            = (known after apply)
+ tags                               = {
+ "terraform-aws-modules" = "eks"
        }
+ tags_all                           = {
+ "Environment"           = "stg"
+ "HashiCorp-Learn"       = "aws-default-tags"
+ "Project"               = "DevOps"
+ "Purpose"               = "Terraform Workshop"
+ "Service"               = "eks"
+ "Terraform"             = "true"
+ "terraform-aws-modules" = "eks"
        }
    }

  # module.eks.module.eks_managed_node_group["one"].module.user_data.null_resource.validate_cluster_service_cidr will be created
+ resource "null_resource" "validate_cluster_service_cidr" {
+ id = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["two"].module.user_data.null_resource.validate_cluster_service_cidr will be created
+ resource "null_resource" "validate_cluster_service_cidr" {
+ id = (known after apply)
    }

Plan: 45 to add, 1 to change, 0 to destroy.

Changes to Outputs:
+ certificate               = (known after apply)
+ cluster_endpoint          = (known after apply)
+ cluster_name              = "demo-cluster-stg"
+ cluster_security_group_id = (known after apply)
+ region                    = "us-east-1"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

```

</details>

:rocket: To apply this plan, run this command: `/apply`




*Pusher: @davidlimacardoso, Action: `pull_request`*